# Напишіть програму-калькулятор,
# яка підтримує такі операції: додавання, віднімання, множення, ділення та піднесення до ступеня.
# Програма має видавати повідомлення про помилку та продовжувати роботу під час введення некоректних даних,
# діленні на нуль та зведенні нуля в негативний степінь.

print("Це програма-калькулятор яка підтримує такі операції:\nдодавання, віднімання, множення, ділення та піднесення до ступеня.")

while True:
    try:
        num_1 = float(input("Вкажіть перше число: "))
        num_2 = float(input("Вкажіть друге число: "))
        break
    except ValueError:
        print("Потрібно ввести два числа!")

while True:
    print("Виберіть операцію над цими числами: ")
    print("1 - додавання")
    print("2 - віднімання")
    print("3 - множення")
    print("4 - ділення")
    print("5 - піднесення до ступеня")
    print("0 - вихід")

    operation = input()

    match operation:
        case "1":
            print(num_1 + num_2)
            break
        case "2":
            print(num_1 - num_2)
            break
        case "3":
            print(num_1 * num_2)
            break
        case "4":
            try:
                print(num_1 / num_2)
                break
            except ZeroDivisionError:
                print("На нуль ділити не можна,\nоберіть іншу дію, або почніть спочатку")
        case "5":
            try:
                print(num_1 ** num_2)
                break
            except ZeroDivisionError:
                print("Не можна 0 піднести до негативного ступеня,\nоберіть іншу дію, або почніть спочатку")
        case "0":
            break
        case _:
            print("Невірний вибір")
